# Оба формата, как csv, так и json очень популярны. Модули для работы с ними есть практически в каждом языке программирования. Также многие популярные прикладные программы поддерживают импорт и экспорт в эти форматы.

# На практике это означает, что вы вполне можете выгрузить данные из таблицы Excel в формат csv. Далее, с помощью модуля csv, вы можете обработать их, возможно что‑то добавить, что‑то изменить или вовсе убрать. После можно сохранить обработанные данные и снова загрузить в таблицу Excel.

# Оба формата нашли свое применение и в анализе данных, а в открытых источниках можно найти очень много полезной (и не очень) информации именно в этих форматах. Вот, например, несколько проектов, где можно найти такие открытые данные:


# https://data.gov.ru/
# https://opendata.by/
# https://catalog.data.gov/dataset/
#Понимать, как устроены и как работать с этими двумя форматами просто жизненно необходимо современному программисту.