# Всемирная Паутина (англ. World Wide Web) — это миллионы компьютеров, связанные друг с другом, которые обмениваются данными с помощью сети Интернет.

# Для обозначения Всемирной паутины также используют слово «Веб» (англ. web «паутина») и аббревиатуру «WWW».

# Интернет — это основа, благодаря которой и существует Всемирная Паутина.

# Чтобы обменяться данными с компьютером в сети Интернет, нужно как‑то узнать, что это за компьютер и как‑то найти его среди многих других компьютеров. Поэтому каждый компьютер, подключенный к сети, имеет свой уникальный адрес для связи: этот адрес называют IP-адресом. IP — это сокращение от Internet Protocol, то есть протокол интернета.

# Есть несколько версий протокола IP, на данный момент самая распространенная это версия 4. IP-адреса этой версии записываются как четыре числа, разделенных точками. Например, IP-адрес компьютера, на котором расположен LETPY — 178.172.137.173. Такие адреса не очень удобно запоминать, поэтому обычно адресам присваивают псевдонимы с понятными для человека именами. Эти псевдонимы называются доменными именами.

# Доменное имя — это то, что вы вводите в адресной строке браузера. Для LETPY — это letpy.com
