# Протокол передачи гипертекста (англ. HyperText Transfer Protocol) — это один из наиболее популярных форматов передачи данных во Всемирной паутине. Скорее всего вы видели, что ссылки, которыми с вами делятся друзья, например, в Telegram начинаются с аббревиатур http или https. Это как раз и есть сокращение от названия формата, или как еще говорят, протокола передачи данных. Буква s в https означает secure, то есть безопасный.

# Как только вы набираете доменное имя в строке браузера, либо переходите по ссылке, интернет-браузер формирует запрос — по сути это просто текст, написанный по определенным правилам.

# С помощью доменного имени находится компьютер в сети, которому этот запрос предназначается.

# Как правило, на этом далеком и неизвестном компьютере работает программа, которая называется Веб-сервером. Эта программа может принимать такие запросы в формате http и https и отвечать на них. Ответ на запрос браузер интерпретирует и отображает на экране.

# Например, если вы перейдете по ссылке https://letpy.com/simple-html-example/, то отобразится очень простая страница. Внешне все это происходит довольно просто и быстро — открыли ссылку и увидели страницу.

# На самом деле, браузер сформирует текстовый запрос и отправит на один из компьютеров, находящийся в одном из дата-центров Беларуси. Программа, запущенная на этом компьютере, определит, какая страница вам нужна, сформирует ответ и отдаст его браузеру. Браузер в свою очередь интерпретирует ответ веб-сервера и отобразит страницу в том виде, в котором вы ее видите.
