# Ответ от веб-сервера в браузере можно посмотреть и не интерпретированным. Для этого перейдите по ссылке с примером простой страницы https://letpy.com/simple-html-example/ и нажмите сочетание клавиш CTRL + U или COMMAND + OPTION + U в macOS).

# Для того чтобы эта комбинация клавиш сработала в Safari, нужно активировать режим разработчика. Для этого:

# Выберите Safari в меню браузера, расположенного в верхней части экрана;

# Когда появится раскрывающееся меню, выберите параметр Настройки;

# Настройки Safari теперь должны быть видны. Нажмите на значок «Дополнительно», расположенный в правой части верхнего ряда;

# Внизу раздела «Дополнительно» находится опция «Показать меню разработки» в строке меню, сопровождаемая пустым флажком. Установите этот флажок и закройте окно настроек, щелкнув по красному значку «х» в верхнем левом углу.

# Тот текст, который вы увидите, и есть гипертекст. И написан он по правилам языка разметки гипертекста HTML (англ. HyperText Markup Language). Просмотрите исходный код страницы целиком, все выглядит довольно просто, верно?

# Вот, например, часть такого гипертекста html <h1>Заголовок</h1> <p> Тут у нас просто <small>какой‑то</small> текст. Часть его написана <strong>жирным шрифтом</strong>, а часть <i>курсивом</i> </p> Слова в треугольных скобках — это теги. С их помощью браузер понимает, что делать с текстом. Например, весь текст, который находится между тегами <small> и </small> будет отображен меньшим размером шрифта.

# HTML-верстка — это отдельная большая история и профессия в IT индустрии. Поэтому в рамках нашего курса подробно на HTML мы останавливаться не будем. На данном этапе важно понять и запомнить, что это просто текст, который записан по определенным правилам.
