# Как вы помните, для создания объектов встроенных типов используются различные способы. Например, списки создаются с помощью квадратных скобок

# data = []
# Помимо этого способа, можно использовать и создание через название класса.
# data = list()
# То есть, мы пишем название класса list, скобки и в итоге получаем созданный список (то есть объект класса list) в переменной data.

# Все это будет работать и с нашим классом ExampleClass из предыдущего урока
# class ExampleClass:
#     pass

# example = ExampleClass()
# Теперь в переменной example у нас хранится объект(или экземпляр) класса ExampleClass.

# Чтобы пройти этот урок, напишите программу, в которой будет создан один класс с названием MyFirstClass и переменная с именем first_object, в которой будет храниться экземпляр класса MyFirstClass.

# # 1
# class MyFirstClass:
#     pass

# first_object = MyFirstClass()
# # 2 
# class MyFirstClass:
#     pass

# first_object = MyFirstClass()