# до этого урока я использовал оператор присваивания = чтобы связать имя переменной с её значением 
# существуют и другие операторы , например
a = 10
print(a == 10) # оператор == сравнения 
# этот оператор сравнит значения операндов, по сути говоря он спрашивает "значение переменной a равно 10?"
# в случае если да то результат True, если нет то False 

a = 11
print(a == 10) # False , а не равно 11
a = 10 
print(a == 11) # False , a не равно 10

#//////////////////////////// другие операторы сравнения

a = 10
print(a > 5) #Оператор сравнения > вернёт True если a больше 5, а = 10, 10 больше 5 , результат True

a = 15
print(a < 5) #Оператор сравнения < Вернёт True если а меньше 5, а = 15 , 15 не меньше 5, результат False 

