# Другие операторы сравнения 
a = 10
print(a != 5) # Результатом будет True, поскольку 
# != означает а не равно 5 , в данном примере условие истинно, если a = 5 то True 
a = 5 
print(a != 5) #False 

#////////////////////////////////////////

a = 11
print(a >= 10) # Оператор сравнения >= больше либо равно означает что
# Результатом будет True, если переменная а больше либо равна операнду после знака >=
# если а меньше то результатом будет False/ В этом примере результат Tue 
a = 10
print(a >= 10) # True
a = 9
print(a >= 10) #False 
 
 #///
a = 10 
print(a <= 11) #Оператор сравнения <= работает аналогично предыдущему, но только наоборот, результат False будет только
# в том случае если значение переменной а больше операнда после знака <= /Тут True 
a= 11
print(a <= 11) #True
a = 12 
print(a <= 11) #False