# Библиотеки или модули расширяют возможности языка Питон и упрощают написание программ. Например, с помощью модуля datetime можно удобно работать с датой и временем, а модуль math помогает при работе с числами.

# Чтобы использовать библиотеку в своей программе, ее нужно импортировать с помощью оператора import. Например, эта программа выведет на экран текущую дату и время:
# import time
# print(time.asctime())
# А эта — значение обратного гиперболического тангенса от числа 0.5:
# import math
# print(math.atanh(0.5))
# Чтобы использовать модули в Питоне нужно написать оператор import, а потом название модуля. Для того, чтобы использовать функцию модуля внутри программы, надо написать название модуля, точку, название функции и параметры этой функции в скобках. Если параметров нет — надо ставить открывающую и закрывающую скобку. Все как в обычных встроенных функциях.

# Модулей для Питона много и для решения практически каждой задачи найдется что‑нибудь полезное: библиотеки для рисования картинок, обработки текста и даже программирования искусственного интеллекта.

# У каждой библиотеки есть документация и любую библиотеку можно освоить, если приложить достаточно усилий.