age = 25 #Создаётся переменная age и связывается со значением 25
         #Такая операция называется присваиванием,знак = называется ОПЕРАТОРОМ ПРИСВАИВАНИЯ
         #имя переменной(операнд присваивания)-оператор присваивания-значение переменной(операнд значения)
print(age) #выводит значение переменной age

a = 2
b = 3 
print(a,b)

# а позже оказалось что есть ещё другие операторы
a = 3 + 2 #например оператор сложения +
b = a + 1
if b > a: #или оператор сравнения > 
    print('Умница')
else:
    print('Не, не катит')

# короче мир полон неизвестного , ты уже запомнил что ты можешь обьявить любую какую хошь переменную и задать ей какое хошь
# значение и если соблюдены условия Строгой типизации и ты не складываешь строку с числом то ты гений , не задерживайся тут 
# и иди дальше 