# Вы уже заметили, что списки, строки и действия над ними, похожи друг на друга. Доступ к элементу, срезы и получение длины — все это делается одинаково и для списков и для строк.

# Коллекция — это общее название для таких структур данных, которые содержат в себе набор значений одного или разных типов, и позволяющих обращаться к этим значениям. То есть, и списки, и строки — это коллекции.

# Цикл for может перебирать любую коллекцию. И список
# collection = [1, "1", 1.5, 12]
# for c in collection:
#     print(c)

# и строку
# string = "Строка для перебора"
# for s in string:
#     print(s)

# Конечно, между строками и списками есть отличия. Например, методы строк и списков отличаются друг от друга. И это логично — странно искать подстроку в списке чисел, или, например, сортировать буквы в строке по возрастанию.
