# В этом уроке надо написать программу, в которой переменной first_dict присвоен словарь.

# В этом словаре должно быть три ключа:

# Первый ключ должен быть строкой, а его значение должно быть целым числом. Значение строки и числа могут быть любыми.

# Второй ключ должен быть любым кортежем, а его значение — любым списком.

# Третий ключ должен быть числом с плавающей запятой, а его значение — любой строкой

# Программа должна вывести на экран значение каждого из ключей.

# # 1 
# first_dict = {
#     'string': 123,
#     (5,): ['it`s a list'],
#     3.4: 'some a string'
#     }

# print(first_dict)
# # 2 
# first_dict = {
#     'first': 777,
#     (2, 3): [3, 4],
#     3.3: 'last'}
# print(first_dict)
# # 3 
# first_dict = {"Один": 1, (2,3):["Two", "three"],1.2: "Строка"}
# for item in first_dict:
#     print(first_dict[item])

