a = 5 
b = 5
c = a + b 
print(c) #сложение
d = c - 2 
print(d)#вычитание
e = d * a 
print(e) #умножение 
division = e / 2
print(division)#деление
a = 13.5
b = 2
c = a % b 
print(c) #Деление по модулю при котором возвращается только остаток  ( используй в будущем при проверке на чётность , остаток есть = нечётное)
exponentiation = a ** c
print(exponentiation) #Возведение в степень 
integer = exponentiation // b
print(integer) #Целочисленное деление, возвращается только целое число, остаток опускается


a = 10.5 * 2
b = a + (a / 3)
c = (a + b ) * 2
print(a, b, c)

# Привет из будущего , оставить этот урок и переписать сюда данные из других, займись этим вечером 
