# Как вы уже знаете, программа — это последовательность команд для компьютера. Бывает так, что какая‑то часть программы неоднократно повторяется. Чтобы устранить эти повторы программного кода, используют функции. Функция — это именованный блок кода, который вызывается в нужных местах программы по имени.

# В предыдущих уроках вы уже сталкивались с функциями, которые, например, вычисляют длину строки или рисуют квадрат. Создать, или, как говорят программисты, объявить свою функцию можно с помощью ключевого слова def

# Если выполнить следующий код
# def my_function():
#     print("Эта строка напечатана из функции")
#     print("И вторая строка")


# my_function()
# my_function()

# на экран будет выведено
# Эта строка напечатана из функции
# И вторая строка
# Эта строка напечатана из функции
# И вторая строка

# Обратите внимание, что функцию my_function() мы вызываем дважды и она дважды выводит на экран заданный текст